puts "User script [info script]"

set_db add_fillers_preserve_user_order true
set_db add_fillers_no_single_site_gap false
set_db add_fillers_with_drc true

# set_db add_fillers_cells { \
# DCAP32BWP20P90 DCAP16BWP20P90 DCAP8BWP20P90 DCAP4BWP20P90 \
# FILL64BWP20P90 FILL64BWP20P90LVT FILL64BWP20P90ULVT \
# FILL32BWP20P90 FILL32BWP20P90LVT FILL32BWP20P90ULVT \
# FILL16BWP20P90 FILL16BWP20P90LVT FILL16BWP20P90ULVT \
# FILL8BWP20P90 FILL8BWP20P90LVT FILL8BWP20P90ULVT \
# FILL4BWP20P90 FILL4BWP20P90LVT FILL4BWP20P90ULVT \
# FILL3BWP20P90 FILL3BWP20P90LVT FILL3BWP20P90ULVT \
# FILL2BWP20P90 FILL2BWP20P90LVT FILL2BWP20P90ULVT \
# FILL1BWP20P90 FILL1BWP20P90LVT FILL1BWP20P90ULVT }

set_db add_fillers_cells { \
DCAP32BWP20P90 DCAP16BWP20P90 DCAP8BWP20P90 DCAP4BWP20P90 \
FILL64BWP20P90 FILL64BWP20P90LVT \
FILL32BWP20P90 FILL32BWP20P90LVT \
FILL16BWP20P90 FILL16BWP20P90LVT \
FILL8BWP20P90 FILL8BWP20P90LVT \
FILL4BWP20P90 FILL4BWP20P90LVT \
FILL3BWP20P90 FILL3BWP20P90LVT \
FILL2BWP20P90 FILL2BWP20P90LVT \
FILL1BWP20P90 FILL1BWP20P90LVT }

add_fillers

check_filler

# if there's filler gap, delete the nearby violation TAPCUTOD manually, and re-run add_fillers
# add_fillers
# check_filler


#check_drc
#add_fillers -fix_drc

write_db dbs/15_add_filler.enc